package testProject;

public class Gaekchaepractice3 {

		//class = 설계도
		//찍어낸 메모리 = instance 객체
		//void = 반환값이 없는 method
		//컴파일러가 메인을 호출해서 씀
		//컴파일러가 매개변수를 가지고 우리걸 읽을려면 클래스의 시작점이
		//있어야함 그게 main(클래스를 지정해서 실행 하는데 main이 있어야 읽을 수 있음)
		//main이 어디에 있건 제일 먼저 읽어준다 그러고 나서 위에서부터 순차적으로 읽음
		//args = 
		
		//method 만드든 방식
		//설정 리턴값 메서드 이름(매개변수){
		//실행할 코드
		//}
		
		//메서드는 클래스 안에서 정의, 소괄호 있으면 메서드

		//class에 들어갈수 있는 것 2가지 (필드(데이터), 메서드(기능))
		//변수의 스코프 = 변수를 사용할 수 있는 범위
		//변수가 만들어진 시점부터 중괄호 끝나는 시점까지 쓸 수 있다
		//중괄호를 묶으면 지역시 생성되고 지역에서만 사용 가능
		
		
		

}
